## create pandas data structure slides(1-17)

In [47]:
import pandas as pd 

#creating a series from a list

series = pd.Series([10,20,30,40,50])
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [48]:
data={ 'Name': ["alice", "bob" , "charlie"],
        'Age': [25 ,30 ,35],
      'City': ["Ismailia", "Fayoum" , "Cairo"]
     }
df = pd.DataFrame(data)
print(df)

      Name  Age      City
0    alice   25  Ismailia
1      bob   30    Fayoum
2  charlie   35     Cairo

## 
Viewing and inspecting Data slide 18-20

In [49]:
df.head()

      Name  Age      City
0    alice   25  Ismailia
1      bob   30    Fayoum
2  charlie   35     Cairo

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [51]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

## selecting and filtering data (slides 21-24)

In [52]:
#select a  column 
print(df["Name"])

0      alice
1        bob
2    charlie
Name: Name, dtype: object

In [53]:
#filtering based on condition 
filtered_df = df[df["Age"]<35]
print(filtered_df)

    Name  Age      City
0  alice   25  Ismailia
1    bob   30    Fayoum

In [54]:
#selecting specific Rows and Columns
selected_data= df.loc[0:1 ,["Name","City"]]
print(selected_data)

    Name      City
0  alice  Ismailia
1    bob    Fayoum

## modifying data (slides 24-27)

In [55]:
#adding new columns 
df["salary"]=["55000","70000","68000"]
print(df)

      Name  Age      City salary
0    alice   25  Ismailia  55000
1      bob   30    Fayoum  70000
2  charlie   35     Cairo  68000

In [56]:
df["Age"]=df["Age"]+1
print(df)

      Name  Age      City salary
0    alice   26  Ismailia  55000
1      bob   31    Fayoum  70000
2  charlie   36     Cairo  68000

In [57]:
df=df.drop("City", axis=1)
print(df)

      Name  Age salary
0    alice   26  55000
1      bob   31  70000
2  charlie   36  68000

## Habdelling missing data slides(28-33)

In [59]:
df_with_nan= pd.DataFrame({"A":[1,2,None], "B":[1,None,3], "C":[None,2,3]})
print(df_with_nan.isnull())

       A      B      C
0  False  False   True
1  False   True  False
2   True  False  False

In [61]:
df_with_nan.isnull().sum()

A    1
B    1
C    1
dtype: int64

In [65]:
df_with_nan.isnull().sum().sum()

3

In [66]:
df_with_nan.isna()

       A      B      C
0  False  False   True
1  False   True  False
2   True  False  False